"""
Даны два натуральных числа m и n. Напишите программу, которая сокращает дробь m/n и выводит ее.
"""

from fractions import Fraction as F

print(F(int(input()), int(input())))
